mybatis.org
* MyBatis + Spring
** 第一步，创建 Gradle 项目，引入相应 jar 包
#+BEGIN_SRC java
  compile (
           // Databases
           "cn.easyproject:ojdbc7:12.1.0.2.0",
           "c3p0:c3p0:0.9.1.2",

           // Spring
           "org.springframework:spring-web:$springVersion",
           "org.springframework:spring-aop:$springVersion",
           "org.springframework:spring-orm:$springVersion",

           // MyBatis And Plugin
           "org.mybatis:mybatis:3.4.2",
           "org.mybatis:mybatis-spring:1.3.1"
           )
#+END_SRC

