out/mybatis.html


<section id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> MyBatis + Spring</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 第一步，创建 Gradle 项目，引入相应 jar 包</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-java">compile <span style="color: #707183;">(</span>
         <span style="color: #b22222;">// </span><span style="color: #b22222;">Databases</span>
         <span style="color: #8b2252;">"cn.easyproject:ojdbc7:12.1.0.2.0"</span>,
         <span style="color: #8b2252;">"c3p0:c3p0:0.9.1.2"</span>,

         <span style="color: #b22222;">// </span><span style="color: #b22222;">Spring</span>
         <span style="color: #8b2252;">"org.springframework:spring-web:$springVersion"</span>,
         <span style="color: #8b2252;">"org.springframework:spring-aop:$springVersion"</span>,
         <span style="color: #8b2252;">"org.springframework:spring-orm:$springVersion"</span>,

         <span style="color: #b22222;">// </span><span style="color: #b22222;">MyBatis And Plugin</span>
         <span style="color: #8b2252;">"org.mybatis:mybatis:3.4.2"</span>,
         <span style="color: #8b2252;">"org.mybatis:mybatis-spring:1.3.1"</span>
         <span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
