mybatis.org
** 配置文件
我们可以将 mybatis 的核心配置文件合并到 spring 中:
#+BEGIN_SRC xml
  <?xml version="1.0" encoding="UTF-8"?>
  <beans xmlns="http://www.springframework.org/schema/beans"
         xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
         xmlns:context="http://www.springframework.org/schema/context"
         xmlns:tx="http://www.springframework.org/schema/tx"
         xsi:schemaLocation="http://www.springframework.org/schema/beans http://www.springframework.org/schema/beans/spring-beans.xsd http://www.springframework.org/schema/context http://www.springframework.org/schema/context/spring-context.xsd http://www.springframework.org/schema/tx http://www.springframework.org/schema/tx/spring-tx.xsd">

    <!-- 外部资源文件 -->
    <context:property-placeholder location="classpath:db.properties" ignore-unresolvable="true"/>

    <!-- 配置数据源 -->
    <!-- 这里使用的是 c3p0，比较经典的商业上比较成熟的数据源管理包 -->
    <!-- Spring 也内置了一个数据源管理类，我们开发环境可以用，但生产环境就不要用了。因为它太简陋了。 -->
    <!-- 现在使用比较多的，还有阿里云的数据源管理 jar 包，你们可以自行查询 -->
    <bean id="dataSource" class="com.mchange.v2.c3p0.ComboPooledDataSource" destroy-method="close">
      <property name="user" value="${user}"/>
      <property name="password" value="${password}"/>
      <property name="jdbcUrl" value="${url}"/>
      <property name="driverClass" value="${driver}"/>
    </bean>


    <!-- 将 Sqlsessionfactory 的生成工作交给 spring -->
    <bean id="sqlSessionFactory" class="org.mybatis.spring.SqlSessionFactoryBean">
      <!-- 指明使用的数据源 -->
      <property name="dataSource" ref="dataSource"/>
      <!-- 指明所有的 mapper 文件。虽然，也可以通过注解配置 mybatis，但在实际过程中，尽量用 xml 少用注解，因为这样便于维护。切记。-->
      <property name="mapperLocations" value="classpath:mybatis/*.xml"/>
      <!-- 指明默认的实体类的包名，如果指定了，我们在 mapper 里的 resultType="t.model.User" 可以简写为 resultType="User" -->
      <property name="typeAliasesPackage" value="classpath:t.model"/>
    </bean>


    <!--
        如果仅配置了 sqlSessionFactory，在代码中，调用 selectFromPerson，我们需要这样写：

        // 先通过容器获取 sessionfactory
        @Resource SqlSessionFactory sqlSessionFacotory;
        // 得到 mapper
        PersonDao personDao = sqlSessionFacotory.getMapper(PersonDao.class);
        // 执行方法
        personDao.selectFromPerson(1);
      
      
        但是，如果能将代码简化成这种形式，岂不是更美？
      
        // 直接从容器里取出初始化好的 personDao
        @Resource PersonDao personDao;
        // 指定方法
        personDao.selectFromPerson(1);
      
      
        想这样吗？可以，只需要在 Spring 中配置一个后置处理器就好了。
        简而言之，让 spring 在初始化好后，将 basePackage 里的所有接口都通过 mybatis 产生相应的代理类，然后放到容器里。
        这样，我们以后用的时候，只需要到容器里去拿就可以了。
    -->
    <bean class="org.mybatis.spring.mapper.MapperScannerConfigurer">
      <property name="basePackage" value="it.dao"/>
      <property name="sqlSessionFactoryBeanName" value="sqlSessionFactory"/>
    </bean>


    <!-- 下面是声明式事务，跟之前差不多的 -->
    <bean id="transactionManager" class="org.springframework.jdbc.datasource.DataSourceTransactionManager">
      <property name="dataSource" ref="dataSource"/>
    </bean>

    <tx:annotation-driven proxy-target-class="true"/>

  </beans>

#+END_SRC
