out/mybatis.html

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 配置文件</h3>
<div class="outline-text-3" id="text-2-2">
<p>
我们可以将 mybatis 的核心配置文件合并到 spring 中:
</p>
<div class="org-src-container">

<pre class="src src-xml">&lt;?<span style="color: #a020f0;">xml</span> <span style="color: #a0522d;">version</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">1.0</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">encoding</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">UTF-8</span><span style="color: #8b2252;">"</span>?&gt;
&lt;<span style="color: #0000ff;">beans</span> <span style="color: #483d8b;">xmlns</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">http://www.springframework.org/schema/beans</span><span style="color: #8b2252;">"</span>
       <span style="color: #483d8b;">xmlns</span>:<span style="color: #a0522d;">xsi</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">http://www.w3.org/2001/XMLSchema-instance</span><span style="color: #8b2252;">"</span>
       <span style="color: #483d8b;">xmlns</span>:<span style="color: #a0522d;">context</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">http://www.springframework.org/schema/context</span><span style="color: #8b2252;">"</span>
       <span style="color: #483d8b;">xmlns</span>:<span style="color: #a0522d;">tx</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">http://www.springframework.org/schema/tx</span><span style="color: #8b2252;">"</span>
       <span style="color: #483d8b;">xsi</span>:<span style="color: #a0522d;">schemaLocation</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">http://www.springframework.org/schema/beans http://www.springframework.org/schema/beans/spring-beans.xsd http://www.springframework.org/schema/context http://www.springframework.org/schema/context/spring-context.xsd http://www.springframework.org/schema/tx http://www.springframework.org/schema/tx/spring-tx.xsd</span><span style="color: #8b2252;">"</span>&gt;

  <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#22806;&#37096;&#36164;&#28304;&#25991;&#20214; </span><span style="color: #b22222;">--&gt;</span>
  &lt;<span style="color: #483d8b;">context</span>:<span style="color: #0000ff;">property-placeholder</span> <span style="color: #a0522d;">location</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">classpath:db.properties</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">ignore-unresolvable</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">true</span><span style="color: #8b2252;">"</span>/&gt;

  <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#37197;&#32622;&#25968;&#25454;&#28304; </span><span style="color: #b22222;">--&gt;</span>
  <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#36825;&#37324;&#20351;&#29992;&#30340;&#26159; c3p0&#65292;&#27604;&#36739;&#32463;&#20856;&#30340;&#21830;&#19994;&#19978;&#27604;&#36739;&#25104;&#29087;&#30340;&#25968;&#25454;&#28304;&#31649;&#29702;&#21253; </span><span style="color: #b22222;">--&gt;</span>
  <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> Spring &#20063;&#20869;&#32622;&#20102;&#19968;&#20010;&#25968;&#25454;&#28304;&#31649;&#29702;&#31867;&#65292;&#25105;&#20204;&#24320;&#21457;&#29615;&#22659;&#21487;&#20197;&#29992;&#65292;&#20294;&#29983;&#20135;&#29615;&#22659;&#23601;&#19981;&#35201;&#29992;&#20102;&#12290;&#22240;&#20026;&#23427;&#22826;&#31616;&#38475;&#20102;&#12290; </span><span style="color: #b22222;">--&gt;</span>
  <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#29616;&#22312;&#20351;&#29992;&#27604;&#36739;&#22810;&#30340;&#65292;&#36824;&#26377;&#38463;&#37324;&#20113;&#30340;&#25968;&#25454;&#28304;&#31649;&#29702; jar &#21253;&#65292;&#20320;&#20204;&#21487;&#20197;&#33258;&#34892;&#26597;&#35810; </span><span style="color: #b22222;">--&gt;</span>
  &lt;<span style="color: #0000ff;">bean</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">dataSource</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">class</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">com.mchange.v2.c3p0.ComboPooledDataSource</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">destroy-method</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">close</span><span style="color: #8b2252;">"</span>&gt;
    &lt;<span style="color: #0000ff;">property</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">user</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">value</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">${user}</span><span style="color: #8b2252;">"</span>/&gt;
    &lt;<span style="color: #0000ff;">property</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">password</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">value</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">${password}</span><span style="color: #8b2252;">"</span>/&gt;
    &lt;<span style="color: #0000ff;">property</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">jdbcUrl</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">value</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">${url}</span><span style="color: #8b2252;">"</span>/&gt;
    &lt;<span style="color: #0000ff;">property</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">driverClass</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">value</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">${driver}</span><span style="color: #8b2252;">"</span>/&gt;
  &lt;/<span style="color: #0000ff;">bean</span>&gt;


  <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#23558; Sqlsessionfactory &#30340;&#29983;&#25104;&#24037;&#20316;&#20132;&#32473; spring </span><span style="color: #b22222;">--&gt;</span>
  &lt;<span style="color: #0000ff;">bean</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">sqlSessionFactory</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">class</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">org.mybatis.spring.SqlSessionFactoryBean</span><span style="color: #8b2252;">"</span>&gt;
    <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#25351;&#26126;&#20351;&#29992;&#30340;&#25968;&#25454;&#28304; </span><span style="color: #b22222;">--&gt;</span>
    &lt;<span style="color: #0000ff;">property</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">dataSource</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">ref</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">dataSource</span><span style="color: #8b2252;">"</span>/&gt;
    <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#25351;&#26126;&#25152;&#26377;&#30340; mapper &#25991;&#20214;&#12290;&#34429;&#28982;&#65292;&#20063;&#21487;&#20197;&#36890;&#36807;&#27880;&#35299;&#37197;&#32622; mybatis&#65292;&#20294;&#22312;&#23454;&#38469;&#36807;&#31243;&#20013;&#65292;&#23613;&#37327;&#29992; xml &#23569;&#29992;&#27880;&#35299;&#65292;&#22240;&#20026;&#36825;&#26679;&#20415;&#20110;&#32500;&#25252;&#12290;&#20999;&#35760;&#12290;</span><span style="color: #b22222;">--&gt;</span>
    &lt;<span style="color: #0000ff;">property</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">mapperLocations</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">value</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">classpath:mybatis/*.xml</span><span style="color: #8b2252;">"</span>/&gt;
    <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#25351;&#26126;&#40664;&#35748;&#30340;&#23454;&#20307;&#31867;&#30340;&#21253;&#21517;&#65292;&#22914;&#26524;&#25351;&#23450;&#20102;&#65292;&#25105;&#20204;&#22312; mapper &#37324;&#30340; resultType="t.model.User" &#21487;&#20197;&#31616;&#20889;&#20026; resultType="User" </span><span style="color: #b22222;">--&gt;</span>
    &lt;<span style="color: #0000ff;">property</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">typeAliasesPackage</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">value</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">classpath:t.model</span><span style="color: #8b2252;">"</span>/&gt;
  &lt;/<span style="color: #0000ff;">bean</span>&gt;


  <span style="color: #b22222;">&lt;!--</span>
<span style="color: #b22222;">      &#22914;&#26524;&#20165;&#37197;&#32622;&#20102; sqlSessionFactory&#65292;&#22312;&#20195;&#30721;&#20013;&#65292;&#35843;&#29992; selectFromPerson&#65292;&#25105;&#20204;&#38656;&#35201;&#36825;&#26679;&#20889;&#65306;</span>

<span style="color: #b22222;">      // &#20808;&#36890;&#36807;&#23481;&#22120;&#33719;&#21462; sessionfactory</span>
<span style="color: #b22222;">      @Resource SqlSessionFactory sqlSessionFacotory;</span>
<span style="color: #b22222;">      // &#24471;&#21040; mapper</span>
<span style="color: #b22222;">      PersonDao personDao = sqlSessionFacotory.getMapper(PersonDao.class);</span>
<span style="color: #b22222;">      // &#25191;&#34892;&#26041;&#27861;</span>
<span style="color: #b22222;">      personDao.selectFromPerson(1);</span>


<span style="color: #b22222;">      &#20294;&#26159;&#65292;&#22914;&#26524;&#33021;&#23558;&#20195;&#30721;&#31616;&#21270;&#25104;&#36825;&#31181;&#24418;&#24335;&#65292;&#23682;&#19981;&#26159;&#26356;&#32654;&#65311;</span>

<span style="color: #b22222;">      // &#30452;&#25509;&#20174;&#23481;&#22120;&#37324;&#21462;&#20986;&#21021;&#22987;&#21270;&#22909;&#30340; personDao</span>
<span style="color: #b22222;">      @Resource PersonDao personDao;</span>
<span style="color: #b22222;">      // &#25351;&#23450;&#26041;&#27861;</span>
<span style="color: #b22222;">      personDao.selectFromPerson(1);</span>


<span style="color: #b22222;">      &#24819;&#36825;&#26679;&#21527;&#65311;&#21487;&#20197;&#65292;&#21482;&#38656;&#35201;&#22312; Spring &#20013;&#37197;&#32622;&#19968;&#20010;&#21518;&#32622;&#22788;&#29702;&#22120;&#23601;&#22909;&#20102;&#12290;</span>
<span style="color: #b22222;">      &#31616;&#32780;&#35328;&#20043;&#65292;&#35753; spring &#22312;&#21021;&#22987;&#21270;&#22909;&#21518;&#65292;&#23558; basePackage &#37324;&#30340;&#25152;&#26377;&#25509;&#21475;&#37117;&#36890;&#36807; mybatis &#20135;&#29983;&#30456;&#24212;&#30340;&#20195;&#29702;&#31867;&#65292;&#28982;&#21518;&#25918;&#21040;&#23481;&#22120;&#37324;&#12290;</span>
<span style="color: #b22222;">      &#36825;&#26679;&#65292;&#25105;&#20204;&#20197;&#21518;&#29992;&#30340;&#26102;&#20505;&#65292;&#21482;&#38656;&#35201;&#21040;&#23481;&#22120;&#37324;&#21435;&#25343;&#23601;&#21487;&#20197;&#20102;&#12290;</span>
<span style="color: #b22222;">  </span><span style="color: #b22222;">--&gt;</span>
  &lt;<span style="color: #0000ff;">bean</span> <span style="color: #a0522d;">class</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">org.mybatis.spring.mapper.MapperScannerConfigurer</span><span style="color: #8b2252;">"</span>&gt;
    &lt;<span style="color: #0000ff;">property</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">basePackage</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">value</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">it.dao</span><span style="color: #8b2252;">"</span>/&gt;
    &lt;<span style="color: #0000ff;">property</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">sqlSessionFactoryBeanName</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">value</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">sqlSessionFactory</span><span style="color: #8b2252;">"</span>/&gt;
  &lt;/<span style="color: #0000ff;">bean</span>&gt;


  <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#19979;&#38754;&#26159;&#22768;&#26126;&#24335;&#20107;&#21153;&#65292;&#36319;&#20043;&#21069;&#24046;&#19981;&#22810;&#30340; </span><span style="color: #b22222;">--&gt;</span>
  &lt;<span style="color: #0000ff;">bean</span> <span style="color: #a0522d;">id</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">transactionManager</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">class</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">org.springframework.jdbc.datasource.DataSourceTransactionManager</span><span style="color: #8b2252;">"</span>&gt;
    &lt;<span style="color: #0000ff;">property</span> <span style="color: #a0522d;">name</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">dataSource</span><span style="color: #8b2252;">"</span> <span style="color: #a0522d;">ref</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">dataSource</span><span style="color: #8b2252;">"</span>/&gt;
  &lt;/<span style="color: #0000ff;">bean</span>&gt;

  &lt;<span style="color: #483d8b;">tx</span>:<span style="color: #0000ff;">annotation-driven</span> <span style="color: #a0522d;">proxy-target-class</span>=<span style="color: #8b2252;">"</span><span style="color: #8b2252;">true</span><span style="color: #8b2252;">"</span>/&gt;

&lt;/<span style="color: #0000ff;">beans</span>&gt;
</pre>
</div>
</div>
</div>
